FKDD_COPY_DIFF_3_2026-02-13/Documents/ТестДрайв.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТестДрайв</Name>
			<Comment>Тест-драйв</Comment>
			<BasedOn>
				<xr:Item>Document.ЗаказНаАвтомобиль</xr:Item>
				<xr:Item>Catalog.Контрагенты</xr:Item>
				<xr:Item>Document.Событие</xr:Item>
				<xr:Item>Document.РабочийЛист</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор документа - пользователь, породивший документ.</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Менеджер</Name>
					<Comment>Сотрудник, который будет проводить тест-драйв</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>Идентификатор юридического лица от которого выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Comment>Проект, под который выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Произвольный комментарий к документу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Comment>Документ, на основании которого введен данный</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.РабочийЛист</v8:Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаказНаАвтомобиль</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозОперация</Name>
					<Comment>Выполняемая документом операция</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автомобиль</Name>
					<Comment>Автомобиль для проведения тест-драйва</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Автомобили</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Клиент, для которого проводится тест-драйв</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Comment>Дата начала тест-драйва</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Comment>Дата окончания тест-драйва</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Текущее состояние выполнения тест-драйва</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Comment>Маршрут тест-драйва</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.МаршрутыТестДрайвов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегНаНачало</Name>
					<Comment>Пробег на одометре автомобиля на момент начала тест-драйва</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПробегНаКонец</Name>
					<Comment>Пробег на одометре автомобиля на момент окончания тест-драйва</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатТестДрайва</Name>
					<Comment>Результат проведения тест-драйва</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.РезультатКонтакта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодРегиона</Name>
					<Comment>Код региона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>6</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГорода</Name>
					<Comment>Код города</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТелефона</Name>
					<Comment>Номер телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВнутреннийНомер</Name>
					<Comment>Внутренний номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеТелефона</Name>
					<Comment>Представление телефона</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТелефона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/АСРМ_DSFОбщий_ПротоколПодключения/Ext/Module.bsl
Функция ПолучитьМассивБрендов(Портал) Экспорт   
	//GET /brand
	
	Запрос="/api/brand";
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Попытка
			Список=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		Исключение
			Список=Неопределено;
		КонецПопытки;
		
		Возврат Список;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

Функция ПолучитьМассивМоделей(Портал) Экспорт
	//GET /RefModel
	
	Запрос="/api/model?is_recent=1";
	КоличествоСтраниц= АСРМ_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,"DSF",Портал);
	
	МассивМоделей=Новый Массив;
	
	ТекущаяСтраница = 1;
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению=Запрос+"?page="+Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
		
		Ответ=АСРМ_Запросы.GETЗапрос(ЗапросКВыполнению,"DSF", ,Портал);
		
		Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивЗапроса=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);

			Для каждого Элемент ИЗ МассивЗапроса Цикл
				МассивМоделей.Добавить(АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
			
		КонецЕсли;
		ТекущаяСтраница=ТекущаяСтраница+1;
	КонецЦикла;
	
	Возврат МассивМоделей;
КонецФункции

Функция ПолучитьМассивСотрудников(Портал) Экспорт
	//GET /manager
	
	Запрос="/api/manager";
	КоличествоСтраниц= АСРМ_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,"DSF", Портал);
	
	МассивВозврата=Новый Массив;
	
	ТекущаяСтраница = 1;
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению=Запрос+"?page="+Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
		
		Ответ=АСРМ_Запросы.GETЗапрос(ЗапросКВыполнению,"DSF", ,Портал);
		
		Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивЗапроса=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			Для каждого Элемент ИЗ МассивЗапроса Цикл
				СтрукутураСотрудника=АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент);
				СтрукутураСотрудника.Вставить("name",СокрЛП(СтрукутураСотрудника.last_name+" "+СтрукутураСотрудника.first_name+" "+СтрукутураСотрудника.middle_name));
				
				
				МассивВозврата.Добавить(СтрукутураСотрудника);
			КонецЦикла;
			
		КонецЕсли;
		ТекущаяСтраница=ТекущаяСтраница+1;
	КонецЦикла;
	
	Возврат МассивВозврата;
КонецФункции

Функция ПолучитьМассивИсточниковОбращения(Портал) Экспорт
	//GET /source
	
	Запрос="/api/source";
	КоличествоСтраниц= АСРМ_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,"DSF",Портал);
	
	МассивВозврата=Новый Массив;
	
	ТекущаяСтраница = 1;
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению=Запрос+"?page="+Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
		
		Ответ=АСРМ_Запросы.GETЗапрос(ЗапросКВыполнению,"DSF", ,Портал);
		
		Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивЗапроса=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			Для каждого Элемент ИЗ МассивЗапроса Цикл
				МассивВозврата.Добавить(АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
			
		КонецЕсли;
		ТекущаяСтраница=ТекущаяСтраница+1;
	КонецЦикла;
	
	Возврат МассивВозврата;
КонецФункции

Функция ПолучитьМассивТиповСобытий(Портал) Экспорт
	//GET /event-type
	
	Запрос="/api/event-type";
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	МассивВозврата=Новый Массив;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивЗапроса=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		Для каждого Элемент ИЗ МассивЗапроса Цикл
			МассивВозврата.Добавить(АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
КонецФункции

Функция ПолучитьМассивПричинОтказов(Портал) Экспорт
	//GET /cancel-reason
	
	Запрос="/api/cancel-reason";
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	МассивВозврата=Новый Массив;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивЗапроса=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Для каждого Элемент ИЗ МассивЗапроса Цикл
			МассивВозврата.Добавить(АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
КонецФункции

Функция ПолучитьМассивДолжностей(Портал) Экспорт
	//GET /RefPosition
	
	Запрос="/api/position";
	КоличествоСтраниц= АСРМ_Запросы.ПолучитьКоличествоСтраницИзОтвета(Запрос,"DSF",Портал);
	
	МассивДолжностей=Новый Массив;
	
	ТекущаяСтраница = 1;
	Пока ТекущаяСтраница <= КоличествоСтраниц Цикл
		ЗапросКВыполнению=Запрос+"?page="+Формат(ТекущаяСтраница,"ЧН=0; ЧГ=0");
		
		Ответ=АСРМ_Запросы.GETЗапрос(ЗапросКВыполнению,"DSF", ,Портал);
		
		Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивЗапроса=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			Для каждого Элемент ИЗ МассивЗапроса Цикл
				МассивДолжностей.Добавить(АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент));
			КонецЦикла;
			
		КонецЕсли;
		ТекущаяСтраница=ТекущаяСтраница+1;
	КонецЦикла;
	
	Возврат МассивДолжностей;
КонецФункции

Функция ПолучитьМассивМодельныхГодов(Портал) Экспорт
	//GET /model-year
	
	Запрос="/api/model-year";
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	МассивВозврата=Новый Массив;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивЗапроса=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Для каждого Элемент ИЗ МассивЗапроса Цикл
			МассивВозврата.Добавить(АСРМ_ОбщегоНазначения.СкопироватьРекурсивно(Элемент));
		КонецЦикла;
	КонецЕсли;
	
	Возврат МассивВозврата;
КонецФункции

Функция ПолучитьИдентфикаторКонтрагентаПоКоду(Код, Портал) Экспорт
	
	Идентификатор="";
	
	//GET /client
	Запрос="/api/client?code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=МассивРезультата[0];
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция ПолучитьИдентфикаторКонтрагентаПоТелефону(Телефон, Портал) Экспорт
	
	Идентификатор="";
	Телефон = ОчиститьСтрокуОтНенужныхСимволов(Телефон);
	Телефон = СокрЛП(Прав(Телефон,10));
	//GET /client
	Запрос="/api/client?phone="+АСРМ_Запросы.СтрокаВФорматеURL(Телефон);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=МассивРезультата[0];
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция  ОчиститьСтрокуОтНенужныхСимволов(СтрокаОчищения) Экспорт
	МассивНенужныхСимволов=Новый Массив;
	МассивНенужныхСимволов.Добавить("-");
	МассивНенужныхСимволов.Добавить("(");
	МассивНенужныхСимволов.Добавить(")");
	МассивНенужныхСимволов.Добавить(" ");
	МассивНенужныхСимволов.Добавить("+");
	Для Каждого ЛевыйСимвол Из МассивНенужныхСимволов Цикл
		Пока Найти(СтрокаОчищения,ЛевыйСимвол)>0 Цикл 
			СтрокаОчищения=СтрЗаменить(СтрокаОчищения,ЛевыйСимвол,"");
		КонецЦикла;
	КонецЦикла;
	Возврат СтрокаОчищения;
КонецФункции

Функция СформироватьСтруктуруКонтрагентаДляПередачиПоОписанию(ОписаниеКонтрагента)
	СтруктураПередачи=Новый Структура;
	Если ОписаниеКонтрагента.Тип="ЮридическоеЛицо" Тогда 
		СтруктураПередачи.Вставить("type",1);

		СтруктураПередачи.Вставить("company_name",ОписаниеКонтрагента.Наименование);
		СтруктураПередачи.Вставить("company_inn",ОписаниеКонтрагента.ИНН);
		СтруктураПередачи.Вставить("company_phone",ОписаниеКонтрагента.Телефон);
		//СтруктураПередачи.Вставить("company_email",ОписаниеКонтрагента.email);
	Иначе
		СтруктураПередачи.Вставить("type",0);
	КонецЕсли;
	
	СтруктураПередачи.Вставить("name",ОписаниеКонтрагента.Имя);
	Если ОписаниеКонтрагента.Свойство("Отчество") Тогда
		СтруктураПередачи.Вставить("middle_name",ОписаниеКонтрагента.Отчество);
	КонецЕсли;
	Если ОписаниеКонтрагента.Свойство("Фамилия") Тогда
		СтруктураПередачи.Вставить("last_name",ОписаниеКонтрагента.Фамилия);
	КонецЕсли;
	СтруктураПередачи.Вставить("phone",ОписаниеКонтрагента.Телефон);
	СтруктураПередачи.Вставить("phone_hash",АСРМ_ОбщегоНазначенияСервер.ПолучитьХэшТелефона(ОписаниеКонтрагента.Телефон));
	
	//Если ОписаниеКонтрагента.Свойство("email") Тогда
	//	СтруктураПередачи.Вставить("email",ОписаниеКонтрагента.email);
	//КонецЕсли;
	Если ОписаниеКонтрагента.Свойство("Адрес") Тогда
		СтруктураПередачи.Вставить("address",ОписаниеКонтрагента.Адрес);
	КонецЕсли;

	//birthday (string, optional): День рождения в формате dd.MM.yyyy,
	Если ОписаниеКонтрагента.Свойство("ДатаРождения") Тогда
		СтруктураПередачи.Вставить("birthday",Формат(ОписаниеКонтрагента.ДатаРождения,"ДФ=dd.MM.yyyy"));
	КонецЕсли;

	//client_confirm_communication (boolean, optional): согласие на отправку смс и других уведомлений = ['0 - нет', '1 - да'],
	//may_process_personal_data (boolean, optional): Признак согласия на обработку персональных данных,
	Если ОписаниеКонтрагента.Свойство("СогласиеНаПолучениеSMS") Тогда
		СтруктураПередачи.Вставить("client_confirm_communication",ОписаниеКонтрагента.СогласиеНаПолучениеSMS);
	КонецЕсли;
	
	Если ОписаниеКонтрагента.Свойство("СогласиеНаОбработкуПерсональныхДанных") Тогда
		СтруктураПередачи.Вставить("may_process_personal_data",ОписаниеКонтрагента.СогласиеНаОбработкуПерсональныхДанных);
	КонецЕсли;
	
	Если ОписаниеКонтрагента.Свойство("Пол") Тогда
		СтруктураПередачи.Вставить("sex",?(ОписаниеКонтрагента.Пол="Мужской",1,0));
	КонецЕсли;

	СтруктураПередачи.Вставить("code",ОписаниеКонтрагента.Код);
	
	Возврат СтруктураПередачи;
КонецФункции

Функция СоздатьОбновитьКонтрагента(ОписаниеКонтрагента, РабочийЛист = Неопределено, Портал)  Экспорт
	Идентификатор= ОписаниеКонтрагента.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор=АСРМ_DSFОбщий_ПротоколПодключения.ПолучитьИдентфикаторКонтрагентаПоКоду(ОписаниеКонтрагента.Код, Портал);
		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			Идентификатор=АСРМ_DSFОбщий_ПротоколПодключения.ПолучитьИдентфикаторКонтрагентаПоТелефону(ОписаниеКонтрагента.Телефон, Портал);
		КонецЕсли;
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			Если ТипЗнч(ОписаниеКонтрагента.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
				АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(ОписаниеКонтрагента.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,Идентификатор,"DSF",,,Портал);
			Иначе
				АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(ОписаниеКонтрагента.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,Идентификатор,"DSF", ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруКонтрагентаДляПередачиПоОписанию(ОписаниеКонтрагента);
	
	//POST /client
	
	Запрос="/api/client";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;

		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			Если ТипЗнч(ОписаниеКонтрагента.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
				АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(ОписаниеКонтрагента.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,СтруктураРезультата.id,"DSF",,,Портал);
			Иначе
				АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(ОписаниеКонтрагента.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Client,СтруктураРезультата.id,"DSF", ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист, РабочийЛист,Портал);				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции


Функция ПолучитьИдентфикаторСотрудникаПоКоду(Код, Портал) Экспорт
	
	Идентификатор="";
	
	//GET /manager
	Запрос="/api/manager?code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF",,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
			МассивРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=МассивРезультата[0];
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция СформироватьСтруктуруСотрудникаДляПередачиПоОписанию(Описание)
	СтруктураПередачи=Новый Структура;
	
	//Manager {
	//id (integer, optional): ID менеджера (генерируется автоматически),
	//code (string): Код менеджера во внешней системе,
	СтруктураПередачи.Вставить("code",Описание.Код);
	//dealer_id (integer, optional): ID дилера, подставляется автоматически,
	
	//first_name (string): Имя,
	СтруктураПередачи.Вставить("first_name",Описание.Имя);
	
	//last_name (string, optional): Фамилия,
	СтруктураПередачи.Вставить("last_name",Описание.Фамилия);
	
	//middle_name (string, optional): Отчество,
	СтруктураПередачи.Вставить("middle_name",Описание.Отчество);
	
	//email (string): Email,
	СтруктураПередачи.Вставить("email",Описание.АдресЭлектроннойПочты);
	
	//birthday (string, optional): День рождения в формате dd.MM.yyyy,
	СтруктураПередачи.Вставить("birthday",Формат(Описание.ДатаРождения,"ДФ=dd.MM.yyyy"));
	
	//employment (string, optional): Дата приема на работу в формате dd.MM.yyyyy,
	СтруктураПередачи.Вставить("employment",Формат(Описание.ДатаПриема,"ДФ=dd.MM.yyyy"));
	
	СтруктураПередачи.Вставить("position_list",Описание.Должность);
	
	Возврат СтруктураПередачи;
КонецФункции

Функция СоздатьОбновитьСотрудника(Описание, Портал)  Экспорт
	Идентификатор= Описание.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор=ПолучитьИдентфикаторСотрудникаПоКоду(Описание.Код, Портал);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Сотрудник,Идентификатор,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруСотрудникаДляПередачиПоОписанию(Описание);
	
	//POST /manager
	
	Запрос="/api/manager";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;

		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Сотрудник,СтруктураРезультата.id,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции



Функция ПередатьРабочийЛист(РабочийЛистСсылка,Портал)  Экспорт
	
	Результат=Ложь;
	//1. Контрагент
	Успешно=АСРМ_DSFОбщий_ПротоколПодключения.СоздатьОбновитьКонтрагента(АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеКонтрагентаРЛ(РабочийЛистСсылка,Портал),РабочийЛистСсылка,Портал);
	
	Если НЕ Успешно Тогда
		Возврат Результат;
	КонецЕсли;
	
	//2. Менеджер
	Менеджер=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьМенеджерРЛ(РабочийЛистСсылка);
	ОписаниеМенеджера=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеСотрудника(Менеджер,Портал);
	
	Если Не ЗначениеЗаполнено(ОписаниеМенеджера.Идентификатор) Тогда
		Успешно= АСРМ_DSFОбщий_ПротоколПодключения.СоздатьОбновитьСотрудника(ОписаниеМенеджера, Портал);
		
		Если НЕ Успешно Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;

	//3. Рабочий лист
	ОписаниеРабочегоЛиста=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеРабочегоЛиста(РабочийЛистСсылка,Портал);
	Успешно= АСРМ_DSFОбщий_ПротоколПодключения.СоздатьОбновитьРабочийЛист(ОписаниеРабочегоЛиста, Портал);
	
	Если НЕ Успешно Тогда
		Возврат Результат;
	КонецЕсли;

	
	//4. Автомобиль
	ОписаниеАвтомобиля=АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеАвтомобиляРЛ(РабочийЛистСсылка,Портал);
	Успешно= АСРМ_DSFСервис_ПротоколПодключения.СоздатьОбновитьПотребность(ОписаниеАвтомобиля, РабочийЛистСсылка);
	
	Если НЕ Успешно Тогда
		Возврат Результат;
	КонецЕсли;
		
	
	//5. События
	Для Каждого СтрокаСобытия ИЗ РабочийЛистСсылка.Переговоры Цикл
		ОписаниеСобытия = АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеСобытия(СтрокаСобытия,РабочийЛистСсылка,Портал);
		Успешно=СоздатьОбновитьСобытие(ОписаниеСобытия,Портал);
		Если НЕ Успешно Тогда
			Возврат Результат;
		КонецЕсли;
	КонецЦикла;	
	
	
	ЗапросТД = Новый Запрос();
	ЗапросТД.УстановитьПараметр("парРЛ",РабочийЛистСсылка);
	ЗапросТД.Текст = "ВЫБРАТЬ
	|	ТестДрайв.Ссылка КАК Регистратор,
	|	ТестДрайв.РабочийЛист.Номер КАК НомерРЛ,
	|	ТестДрайв.РабочийЛист.Модель КАК Модель,
	|	ТестДрайв.РабочийЛист.Контрагент КАК Контрагент,
	|	ТестДрайв.Комментарий КАК Результат,
	|	"""" КАК СОдержание,
	|	ТестДрайв.Номер КАК Номер,
	|	ТестДрайв.РабочийЛист.Менеджер КАК Менеджер,
	|	ТестДрайв.ДатаОкончания КАК ДатаНачала,
	|	ТестДрайв.ДатаНачала КАК Дата,
	|	ТестДрайв.РабочийЛист КАК РабочийЛист,
	|	""test-drive"" КАК ТипСобытия
	|ИЗ
	|	Документ.ТестДрайв КАК ТестДрайв
	|ГДЕ
	|	ТестДрайв.РабочийЛист = &парРЛ";
	
	РезультатТД = ЗапросТД.Выполнить().Выбрать();
	
	Пока РезультатТД.Следующий() Цикл
		ОписаниеСобытия = АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеСобытияТД(РезультатТД,РабочийЛистСсылка,Портал);
		Успешно=СоздатьОбновитьСобытие(ОписаниеСобытия,Портал);
		Если НЕ Успешно Тогда
			Возврат Результат;
		КонецЕсли;

	КонецЦикла;

	
	//Контракт и Выдача из документов
	ЗапросКонтракт = Новый Запрос();
	ЗапросКонтракт.УстановитьПараметр("парРЛ",РабочийЛистСсылка);
	ЗапросКонтракт.Текст =
	"ВЫБРАТЬ
	|	ЗаказНаАвтомобиль.Ссылка КАК Регистратор,
	|	ЗаказНаАвтомобиль.ДокументОснование КАК РЛ,
	|	ЗаказНаАвтомобиль.ДокументОснование.Номер КАК НомерРЛ,
	|	ЗаказНаАвтомобиль.ДокументОснование.Модель КАК Модель,
	|	ЗаказНаАвтомобиль.Контрагент КАК Контрагент,
	|	ЗаказНаАвтомобиль.Комментарий КАК СОдержание,
	|	ЗаказНаАвтомобиль.Номер КАК Номер,
	|	ЗаказНаАвтомобиль.ДокументОснование.Менеджер КАК Менеджер,
	|	ЗаказНаАвтомобиль.Дата КАК ДатаОкончания,
	|	ЗаказНаАвтомобиль.Дата КАК Дата,
	|	ЗаказНаАвтомобиль.Дата КАК ДатаНачала,
	|	ЗаказНаАвтомобиль.ДокументОснование КАК РабочийЛист,
	|	""contract"" КАК ТипСобытия,
	|	ЗаказНаАвтомобиль.СуммаДокумента
	|ИЗ
	|	Документ.ЗаказНаАвтомобиль КАК ЗаказНаАвтомобиль
	|ГДЕ
	|	ЗаказНаАвтомобиль.РабочийЛист = &парРЛ";
	
	РезультатКонтракт = ЗапросКонтракт.Выполнить().Выбрать();
	
	Если РезультатКонтракт.Следующий() Тогда
		ОписаниеСобытия = АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеСобытияДокументов(РезультатКонтракт,РабочийЛистСсылка,Портал);
		Успешно=СоздатьОбновитьСобытие(ОписаниеСобытия,Портал);
		Если НЕ Успешно Тогда
			Успешно=СоздатьОбновитьСобытие(ОписаниеСобытия, Портал);
			Если НЕ Успешно Тогда
				Возврат Результат;
			КонецЕсли;			
		КонецЕсли;
		
	КонецЕсли;
	
	ЗапросВыдача = Новый Запрос();
	ЗапросВыдача.УстановитьПараметр("парРЛ",РабочийЛистСсылка);
	ЗапросВыдача.Текст = "ВЫБРАТЬ
	|	РеализацияАвтомобилей.Ссылка КАК Регистратор,
	|	РеализацияАвтомобилей.ДокументОснование.РабочийЛист КАК РЛ,
	|	РеализацияАвтомобилей.ДокументОснование.РабочийЛист.Номер КАК НомерРЛ,
	|	РеализацияАвтомобилей.ДокументОснование.РабочийЛист.Модель КАК Модель,
	|	РеализацияАвтомобилей.ДокументОснование.РабочийЛист.Контрагент КАК Контрагент,
	|	РеализацияАвтомобилей.Комментарий КАК СОдержание,
	|	РеализацияАвтомобилей.Номер КАК Номер,
	|	РеализацияАвтомобилей.ДокументОснование.РабочийЛист.Менеджер КАК Менеджер,
	|	РеализацияАвтомобилей.Дата КАК ДатаОкончания,
	|	РеализацияАвтомобилей.Дата КАК Дата,
	|	РеализацияАвтомобилей.Дата КАК ДатаНачала,
	|	РеализацияАвтомобилей.ДокументОснование.РабочийЛист КАК РабочийЛист,
	|	""issue"" КАК ТипСобытия
	|ИЗ
	|	Документ.РеализацияАвтомобилей КАК РеализацияАвтомобилей
	|ГДЕ
	|	ТИПЗНАЧЕНИЯ(РеализацияАвтомобилей.ДокументОснование) = ТИП(Документ.ЗаказНаАвтомобиль)
	|	И РеализацияАвтомобилей.ДокументОснование.РабочийЛист = &парРЛ";
	
	РезультатВыдача = ЗапросВыдача.Выполнить().Выбрать();
	
	Если РезультатВыдача.Следующий() Тогда
		ОписаниеСобытия = АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеСобытияДокументов(РезультатВыдача,РабочийЛистСсылка,Портал);
		Успешно=СоздатьОбновитьСобытие(ОписаниеСобытия, Портал);
		Если НЕ Успешно Тогда
			Возврат Результат;
		КонецЕсли;
		
		ЗапросПланирования = Новый Запрос;
		ЗапросПланирования.Текст =
		"ВЫБРАТЬ
		|	ЗадачаСотруднику.Ссылка,
		|	ЗадачаСотруднику.ВерсияДанных,
		|	ЗадачаСотруднику.ПометкаУдаления,
		|	ЗадачаСотруднику.Номер,
		|	ЗадачаСотруднику.Дата,
		|	ЗадачаСотруднику.Наименование,
		|	ЗадачаСотруднику.Выполнена,
		|	ЗадачаСотруднику.CallBack,
		|	ЗадачаСотруднику.Автомобиль,
		|	ЗадачаСотруднику.Основание,
		|	ЗадачаСотруднику.Автор,
		|	ЗадачаСотруднику.Важность,
		|	ЗадачаСотруднику.ВидЗадачи,
		|	ЗадачаСотруднику.Звонили,
		|	ЗадачаСотруднику.ДатаАвтозакрытия,
		|	ЗадачаСотруднику.ДатаЗакрытия,
		|	ЗадачаСотруднику.ДатаЗвонили,
		|	ЗадачаСотруднику.ДатаПерезвонить,
		|	ЗадачаСотруднику.ДлительностьРазговора,
		|	ЗадачаСотруднику.ИтогиВстречи,
		|	ЗадачаСотруднику.Клиент,
		|	ЗадачаСотруднику.КонтактноеЛицо,
		|	ЗадачаСотруднику.Описание,
		|	ЗадачаСотруднику.Результат,
		|	ЗадачаСотруднику.Телефон,
		|	ЗадачаСотруднику.УИН,
		|	ЗадачаСотруднику.ДокументРезультат,
		|	ЗадачаСотруднику.СкидкаНаРаботы,
		|	ЗадачаСотруднику.СкидкаНаТовары,
		|	ЗадачаСотруднику.ЗаписьРазговора,
		|	ЗадачаСотруднику.Пользователь,
		|	ЗадачаСотруднику.Роль,
		|	ЗадачаСотруднику.Подразделение,
		|	ЗадачаСотруднику.СтруктурнаяЕдиница
		|ИЗ
		|	Задача.ЗадачаСотруднику КАК ЗадачаСотруднику
		|ГДЕ
		|	ЗадачаСотруднику.Основание = &парРЛ";
		ЗапросПланирования.УстановитьПараметр("парРЛ",РезультатВыдача.Регистратор);
		РезультатПланирования= ЗапросПланирования.Выполнить().Выбрать();
		
		Если РезультатПланирования.Следующий() Тогда	
			ОписаниеПланирования = АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьОписаниеПланирования(РезультатПланирования,РабочийЛистСсылка,Портал);
			Успешно=СоздатьОбновитьПланирование(ОписаниеПланирования,Портал);
			Если НЕ Успешно Тогда
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;

	КонецЕсли;
	
	Результат=Истина;
	Возврат Результат;
	

КонецФункции	

Функция ПроверитьНеобходимостьОтправкиРабочегоЛиста(РабочийЛистСсылка,Портал) Экспорт
	
	Результат=Истина;
	Если НЕ ЗначениеЗаполнено(РабочийЛистСсылка.МаркаМодель)  Тогда
		Результат=Ложь;
		Возврат Результат;
	КонецЕсли;
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(АСРМ_DSFСервис_ПереопределяемыйБИТ_УС.ПолучитьБренд(РабочийЛистСсылка.МаркаМодель),ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Бренд,"DSF",,,Портал);
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Результат=Ложь;
	КонецЕсли;
	
	Идентификатор=АСРМ_ОбщегоНазначенияСервер.ПолучитьИдентификаторСоответствияПоОбъекту(РабочийЛистСсылка.МаркаМодель,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Модель,"DSF",,,Портал);
	
	Если Не ЗначениеЗаполнено(Идентификатор) Тогда
		Результат=Ложь;
	КонецЕсли;
	Если  РабочийЛистСсылка.События.Количество() = 0 Тогда
		Результат=Ложь;
		Возврат Результат;
	КонецЕсли;

	Возврат Результат;
	
КонецФункции

Функция СоздатьОбновитьРабочийЛист(Описание, Портал)  Экспорт
	Идентификатор= Описание.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор=ПолучитьИдентфикаторРабочегоЛистаПоКоду(Описание.Номер, Портал);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,Идентификатор,"DSF", ,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруРабочегоЛистаДляПередачиПоОписанию(Описание);
	
	//POST /worksheet
	
	Запрос="/api/worksheet";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;
		
		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.РабочийЛист,СтруктураРезультата.id,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;


	Возврат Результат;
КонецФункции

Функция СформироватьСтруктуруРабочегоЛистаДляПередачиПоОписанию(Описание)
	СтруктураПередачи=Новый Структура;
	
	СтруктураПередачи.Вставить("code",Описание.Номер);
	
	//dateOpen (string): Дата открытия заказ-наряда в формате dd.MM.yyyy,
	СтруктураПередачи.Вставить("open",Формат(Описание.ДатаСоздания,"ДФ=dd.MM.yyyy"));
	
	//dateClose (string, optional): Дата закрытия заказ-наряда в формате dd.MM.yyyy,
	СтруктураПередачи.Вставить("created",Формат(Описание.ДатаСоздания,"ДФ=dd.MM.yyyy"));
	
	//client_id (integer): ID клиента,
	СтруктураПередачи.Вставить("client_id",Описание.КонтрагентИдентификатор);
	
	//purchase_type_id (integer): ID типа заказ-наряда. Получение списка осуществляется методом purchase-type,
	СтруктураПередачи.Вставить("source_id ",Описание.ИсточникОбращения);
	//СтруктураПередачи.Вставить("cancel_reason_id  ",Описание.ПричинаОтказа);
	
	Возврат СтруктураПередачи;
КонецФункции

Функция СоздатьОбновитьСобытие(Описание, Портал)  Экспорт
	Идентификатор = Описание.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = ПолучитьИдентфикаторСобытияПоКоду(Описание.Код, Портал);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Событие,Идентификатор,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруСобытияДляПередачиПоОписанию(Описание);
	
	//POST /event
	
	Запрос="/api/event";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;

		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.Событие,СтруктураРезультата.id,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция СформироватьСтруктуруСобытияДляПередачиПоОписанию(Описание)
	СтруктураПередачи=Новый Структура;
	СтруктураПередачи.Вставить("status",Описание.Статус);
	СтруктураПередачи.Вставить("code",Описание.Код);
	СтруктураПередачи.Вставить("event_type",Описание.ТипСобытияИдентификатор);
	СтруктураПередачи.Вставить("car_id",Описание.АвтомобильИдентификатор);
	СтруктураПередачи.Вставить("worksheet_id  ",Описание.РабочийЛистИдентификатор);
	СтруктураПередачи.Вставить("client_id",Описание.КонтрагентИдентификатор);
	СтруктураПередачи.Вставить("manager_id",Описание.МенеджерИдентификатор);
	СтруктураПередачи.Вставить("comment",Описание.Комментарий);
	СтруктураПередачи.Вставить("is_primary",Описание.Первичное);
	СтруктураПередачи.Вставить("occurred",Строка(Формат(Описание.ВремяСобытия, "ДФ=dd.MM.yyyy")) + " " + Строка(Формат(Описание.ВремяСобытия, "ДФ=ЧЧ:мм")));
	Попытка
		СтруктураПередачи.Вставить("amount",Описание.Стоимость);
	Исключение
	КонецПопытки;
	Возврат СтруктураПередачи;
КонецФункции

Функция ПолучитьИдентфикаторРабочегоЛистаПоКоду(Код, Портал) Экспорт
	
	Идентификатор="";
	
	//GET /worksheet
	Запрос="/api/worksheet?code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивРезультата = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=МассивРезультата[0];
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция ПолучитьИдентфикаторСобытияПоКоду(Код, Портал) Экспорт
	
	Идентификатор="";
	
	//GET /event
	Запрос="/api/event?code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивРезультата = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=МассивРезультата[0];
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция СоздатьОбновитьПланирование(Описание,Портал)  Экспорт
	Идентификатор = Описание.Идентификатор;
	Если не ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = ПолучитьИдентфикаторПланированияПоКоду(Описание.Код,Портал);
		
		Если ЗначениеЗаполнено(Идентификатор) Тогда
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ПланированиеКонтакта,Идентификатор,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	СтруктураПередачи=СформироватьСтруктуруПланированияДляПередачиПоОписанию(Описание);
	
	//POST /nearest-contact
	
	Запрос="/api/nearest-contact";
	ТелоЗапроса=АСРМ_JSON.мЗаписатьJSON(СтруктураПередачи,Истина);
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Запрос=Запрос+"/"+Формат(Идентификатор,"ЧГ=0");
		Ответ=АСРМ_Запросы.PUTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	Иначе
		Ответ=АСРМ_Запросы.POSTЗапрос(Запрос,ТелоЗапроса,"DSF",,Портал);
	КонецЕсли;	
	
	Результат=Ложь;
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		Результат=Истина;

		Если НЕ ЗначениеЗаполнено(Идентификатор) Тогда
			СтруктураРезультата=АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
			
			АСРМ_ОбщегоНазначенияСервер.ЗаписатьСоответствиеОбъектов(Описание.Ссылка,ПланыВидовХарактеристик.АСРМ_ВидыОбъектов.ПланированиеКонтакта,СтруктураРезультата.id,"DSF",,,Портал);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
КонецФункции

Функция ПолучитьИдентфикаторПланированияПоКоду(Код,Портал) Экспорт
	
	Идентификатор="";
	
	//GET /nearest-contact
	Запрос="/api/nearest-contact?code="+АСРМ_Запросы.СтрокаВФорматеURL(Код);
	
	Ответ=АСРМ_Запросы.GETЗапрос(Запрос,"DSF", ,Портал);
	
	Если АСРМ_Запросы.ПроверитьУспешностьВыполненияЗапроса(Ответ) Тогда
		МассивРезультата = АСРМ_JSON.мПрочитатьJSON(Ответ.ПолучитьТелоКакСтроку(),Истина);
		
		Если МассивРезультата.Количество()=0 Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		СтурктураРезультата=МассивРезультата[0];
		
		Если Не СтурктураРезультата.Свойство("id") Тогда
			Возврат Идентификатор;
		КонецЕсли;
		
		Идентификатор=СтурктураРезультата.id;
		
	КонецЕсли;
	
	Возврат Идентификатор;
КонецФункции

Функция СформироватьСтруктуруПланированияДляПередачиПоОписанию(Описание)
	СтруктураПередачи=Новый Структура;
	
	СтруктураПередачи.Вставить("code",Описание.Код);
	СтруктураПередачи.Вставить("opened",Строка(Формат(Описание.ДатаСоздания, "ДФ=dd.MM.yyyy")) + " " +Строка(Формат(Описание.ДатаСоздания, "ДФ=ЧЧ:мм")));	
	Если Описание.ДатаФактическогоЗавершения <> Дата(1, 1, 1) Тогда
		СтруктураПередачи.Вставить("closed",Строка(Формат(Описание.ДатаФактическогоЗавершения, "ДФ=dd.MM.yyyy")) + " " + Строка(Формат(Описание.ДатаФактическогоЗавершения, "ДФ=ЧЧ:мм")));
		//СтруктураПередачи.Вставить("closed",Строка(Описание.ДатаФактическогоЗавершения));
	КОнецЕсли;
	СтруктураПередачи.Вставить("scheduled",Строка(Формат(Описание.ВремяСобытия, "ДФ=dd.MM.yyyy")) + " " + Строка(Формат(Описание.ВремяСобытия, "ДФ=ЧЧ:мм")));
	СтруктураПередачи.Вставить("worksheet_id  ",Описание.РабочийЛистИдентификатор);
	СтруктураПередачи.Вставить("scheduled_message",Описание.Содержание);
	//СтруктураПередачи.Вставить("closed_message",Описание.Результат);
	СтруктураПередачи.Вставить("created",Строка(Описание.ДатаСоздания));
		
	Возврат СтруктураПередачи;
КонецФункции
